#1.re解析
#2.bs4解析
#3.xpath解析

#正则表达式  re
# 网页源码像一麻袋杂豆（红豆绿豆黄豆混一起）。
# 正则就是一张「只挑红豆」的筛网——不是一颗颗找，是把整袋倒上去，符合规则的自动留下。
# 你把「规律」写成一行符号，机器照着捞。

#元字符：!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!
#具有固定含义的特殊符号
# \w 匹配任意一个字母、数字或下划线
# \s 匹配任意一个空白字符
# \d 匹配任意一个数字
# \n 匹配一个换行符
# \t 制表符

# ^ 匹配字符串的开始
# $ 匹配字符串的结束
#^\d\d\d\d\d\d\d\d\d\d\d$表单验证

#他们和小写的匹配是互补的
# \D 匹配任意一个非数字
# \S 匹配任意一个非空白字符
# \W 匹配任意一个非字母、数字或下划线

# a|b 匹配字符a或者b
# () 匹配括号内的表达式
# [] 匹配方括号内的任意一个字符
# [a-zA-Z0-9_]==\w!!!!!!!!!!!
# [^] 匹配方括号外的任意一个字符

#量词：!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!
#控制前面的元字符出现的次数
#\d{5}==\d\d\d\d\d
# . 匹配任意单个字符
# * 匹配前面的元素零次或多次
# + 匹配前面的元素一次或多次
# ? 匹配前面的元素零次或一次
# {n} 匹配前面的元素恰好n次
# {n,} 匹配前面的元素至少n次
# {n,m} 匹配前面的元素至少n次，至多m次

#贪婪匹配和惰性匹配!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!
# .*
# .*?

#玩儿吃鸡游戏，晚上一起上游戏，干嘛呢？打游戏啊
#玩儿.*?游戏(两个词之间，取最少的一种情况)
#共找到 1 处匹配：
#玩儿吃鸡游戏

















